#include<iostream>
using namespace std;
void menu()
{
	printf_s("\n");
	printf_s("\n");
	printf_s("\n");
	printf_s("\n");
	printf_s("\n");
	printf_s("\n");
	printf_s("                                            排序二叉树功能菜单 \n");
	printf_s("                                ---------------------- ---------------------- \n");
	printf_s("                                ********************************************* \n");
	printf_s("                                    * 0.退出排序二叉树 * * 1.创建排序二叉树 * \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 2.插入二叉树元素 * * 3.删除二叉树元素 * \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 4.前序遍历(递归) * * 5.前序遍历(非递归)  \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 6.中序遍历(递归) * * 7.中序遍历(非递归)  \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 8.后序遍历(递归) * * 9.后序遍历(非递归) \n");
	printf_s("                                ********************** **********************\n");
	printf_s("                                    * a.查找二叉树元素 * * b.层序遍历二叉树 * \n");
	printf_s("                                ********************** **********************\n");
	printf_s("                                ---------------------- ---------------------- \n");
	printf_s("\n");
	printf_s("\n");
	printf_s("\n");
}