#include<iostream>
void sqmenu()
{
	printf_s("                                                 顺序栈功能菜单 \n");
	printf_s("                                ---------------------- ---------------------- \n");
	printf_s("                                ********************************************* \n");
	printf_s("                                    * 0.退出本次栈构 * * 1.创建初始栈构 * \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 2.返回栈顶元素 * * 3.清空该次栈构 * \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 4.插入栈顶元素 * * 5.删除栈顶元素 * \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 6.判断栈构为空 * * 7.打印栈构元素 * \n");
	printf_s("                                ********************** ********************** \n");
	printf_s("                                    * 8.统计元素数量 * * 9.销毁本次栈构 *\n");
	printf_s("                                ********************** **********************\n");
	printf_s("\n");
	printf_s("\n");
	printf_s("\n");
}